In [3]:
import io, requests, pandas as pd, numpy as np
from statsmodels.api import OLS, add_constant
from bcb import sgs

In [30]:
m1 = sgs.get(27791, "2002-01-01").loc['2002-01-01':'2025-01-01']
m2 = sgs.get(27810, "2001-01-01").loc['2002-01-01':'2025-01-01']
m3 = sgs.get(27813, "2001-01-01").loc['2002-01-01':'2025-01-01']
m4 = sgs.get(27815, "2001-01-01").loc['2002-01-01':'2025-01-01']

In [31]:
display(m1,m2,m3,m4)

                27791
Date
2002-01-01   76291521
2002-02-01   75679717
2002-03-01   74996003
2002-04-01   76628516
2002-05-01   75674168
...               ...
2024-09-01  646946561
2024-10-01  624046032
2024-11-01  637926183
2024-12-01  677275508
2025-01-01  618269518

[277 rows x 1 columns]

                   27810
Date
2002-01-01  3.172732e+08
2002-02-01  3.181512e+08
2002-03-01  3.271253e+08
2002-04-01  3.258067e+08
2002-05-01  3.281684e+08
...                  ...
2024-09-01  6.372576e+09
2024-10-01  6.418306e+09
2024-11-01  6.498143e+09
2024-12-01  6.658393e+09
2025-01-01  6.544050e+09

[277 rows x 1 columns]

                   27813
Date
2002-01-01  6.286021e+08
2002-02-01  6.304995e+08
2002-03-01  6.421659e+08
2002-04-01  6.417692e+08
2002-05-01  6.418988e+08
...                  ...
2024-09-01  1.190576e+10
2024-10-01  1.196777e+10
2024-11-01  1.189621e+10
2024-12-01  1.210060e+10
2025-01-01  1.208353e+10

[277 rows x 1 columns]

                  27815
Date
2002-01-01    754307152
2002-02-01    753801974
2002-03-01    758774257
2002-04-01    761658308
2002-05-01    762389232
...                 ...
2024-09-01  13150675220
2024-10-01  13265375595
2024-11-01  13350581346
2024-12-01  13484592024
2025-01-01  13437937969

[277 rows x 1 columns]

In [28]:
pib = sgs.get(22099, "2002-01-01").loc['2002-01-01':'2025-01-01']

In [45]:
pib = pib.to_period('Q').to_timestamp('s')

In [46]:
pib

DatetimeIndex(['2002-01-01', '2002-04-01', '2002-07-01', '2002-10-01',
               '2003-01-01', '2003-04-01', '2003-07-01', '2003-10-01',
               '2004-01-01', '2004-04-01', '2004-07-01', '2004-10-01',
               '2005-01-01', '2005-04-01', '2005-07-01', '2005-10-01',
               '2006-01-01', '2006-04-01', '2006-07-01', '2006-10-01',
               '2007-01-01', '2007-04-01', '2007-07-01', '2007-10-01',
               '2008-01-01', '2008-04-01', '2008-07-01', '2008-10-01',
               '2009-01-01', '2009-04-01', '2009-07-01', '2009-10-01',
               '2010-01-01', '2010-04-01', '2010-07-01', '2010-10-01',
               '2011-01-01', '2011-04-01', '2011-07-01', '2011-10-01',
               '2012-01-01', '2012-04-01', '2012-07-01', '2012-10-01',
               '2013-01-01', '2013-04-01', '2013-07-01', '2013-10-01',
               '2014-01-01', '2014-04-01', '2014-07-01', '2014-10-01',
               '2015-01-01', '2015-04-01', '2015-07-01', '2015-10-01',
               '2016-01-01', '2016-04-01', '2016-07-01', '2016-10-01',
               '2017-01-01', '2017-04-01', '2017-07-01', '2017-10-01',
               '2018-01-01', '2018-04-01', '2018-07-01', '2018-10-01',
               '2019-01-01', '2019-04-01', '2019-07-01', '2019-10-01',
               '2020-01-01', '2020-04-01', '2020-07-01', '2020-10-01',
               '2021-01-01', '2021-04-01', '2021-07-01', '2021-10-01',
               '2022-01-01', '2022-04-01', '2022-07-01', '2022-10-01',
               '2023-01-01', '2023-04-01', '2023-07-01', '2023-10-01',
               '2024-01-01', '2024-04-01', '2024-07-01', '2024-10-01',
               '2025-01-01'],
              dtype='datetime64[ns]', name='Date', freq='QS-OCT')

In [51]:
# temos o pib em trimestral e os agregados em mensal, vamos transformar os agregados em mensal para evitar inserir interpolação
m1 = m1.resample('QE').mean().to_period("Q").to_timestamp("s")
m2 = m2.resample('QE').mean().to_period("Q").to_timestamp("s")
m3 = m3.resample('QE').mean().to_period("Q").to_timestamp("s")
m4 = m4.resample('QE').mean().to_period("Q").to_timestamp("s")

In [52]:
m1.to_period("Q").to_timestamp("s")

                   27791
Date
2002-01-01  7.565575e+07
2002-04-01  7.801691e+07
2002-07-01  8.789554e+07
2002-10-01  9.880179e+07
2003-01-01  9.280110e+07
...                  ...
2024-01-01  6.007512e+08
2024-04-01  6.338460e+08
2024-07-01  6.455702e+08
2024-10-01  6.464159e+08
2025-01-01  6.182695e+08

[93 rows x 1 columns]

In [ ]:

def merge_pib_tax_rate

SyntaxError: expected '(' (618690802.py, line 1)